# SetClVectorFill

## Description
Sets the class fill style to use the specified hatch pattern. The function return value will be TRUE if the operation was successful.

```pascal
FUNCTION SetClVectorFill(
				className : STRING;
				hatchName : STRING): BOOLEAN;
```

```python
def vs.SetClVectorFill(className, hatchName):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|className|STRING|Name of class.|
|hatchName|STRING|Name of hatch pattern.|

## Version
Availability: from VectorWorks9.0

## Category
* Classes